docs/Logs/Datentraeger2_test_fio_2_1xdurchgang.txt

(Mo Jun-6 3:49:25)-(CPU 16.8%:0:Net 10)-(giant:~/srv/Projekte/Messungen)-(:14)
> sudo fio --name=seq-read --filename=/dev/sdc --ioengine=libaio \
  --rw=read --bs=128k --size=100% --numjobs=1 --iodepth=8
[sudo] Passwort für giant:
seq-read: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=8
fio-3.42
Starting 1 process
Jobs: 1 (f=1): [R(1)][100.0%][r=535MiB/s][r=4276 IOPS][eta 00m:00s]
seq-read: (groupid=0, jobs=1): err= 0: pid=359293: Mon Jun  8 04:15:35 2026
  read: IOPS=4267, BW=533MiB/s (559MB/s)(477GiB/915554msec)
    slat (usec): min=8, max=4767, avg=231.33, stdev=214.58
    clat (usec): min=2, max=8353, avg=1642.14, stdev=218.97
     lat (usec): min=12, max=8383, avg=1873.47, stdev=54.67
    clat percentiles (usec):
     |  1.00th=[ 1401],  5.00th=[ 1401], 10.00th=[ 1418], 20.00th=[ 1418],
     | 30.00th=[ 1434], 40.00th=[ 1450], 50.00th=[ 1745], 60.00th=[ 1844],
     | 70.00th=[ 1844], 80.00th=[ 1860], 90.00th=[ 1876], 95.00th=[ 1876],
     | 99.00th=[ 1893], 99.50th=[ 1909], 99.90th=[ 2040], 99.95th=[ 2442],
     | 99.99th=[ 3949]
   bw (  KiB/s): min=454656, max=549120, per=100.00%, avg=546769.15, stdev=2876.90, samples=1829
   iops        : min= 3552, max= 4290, avg=4271.58, stdev=22.48, samples=1829
  lat (usec)   : 4=0.01%, 20=0.01%, 500=0.01%, 1000=0.01%
  lat (msec)   : 2=99.89%, 4=0.10%, 10=0.01%
  cpu          : usr=1.46%, sys=15.07%, ctx=1957850, majf=0, minf=269
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3907090,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=533MiB/s (559MB/s), 533MiB/s-533MiB/s (559MB/s-559MB/s), io=477GiB (512GB), run=915554-915554msec

Disk stats (read/write):
  sdc: ios=1953520/0, sectors=1000202240/0, merge=0/0, ticks=1683582/0, in_queue=1683582, util=100.00%