docs/Logs/datentraeger2_test_fio_1_1xdurchgang.txt
(Mo Jun-6 3:48:22)-(CPU 16.8%:0:Net 11)-(giant:~/srv/Projekte/Messungen)-(:13)
> sudo fio --name=rand-write --filename=/dev/sdc --ioengine=libaio \
  --rw=randwrite --bs=4k --size=1G --numjobs=1 \
  --iodepth=32 --runtime=60 --time_based --end_fsync=1
rand-write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.42
Starting 1 process
Jobs: 1 (f=1): [w(1)][100.0%][eta 00m:00s]
rand-write: (groupid=0, jobs=1): err= 0: pid=356190: Mon Jun  8 03:49:25 2026
  write: IOPS=87.1k, BW=340MiB/s (357MB/s)(20.0GiB/60170msec)
    slat (nsec): min=1560, max=1043.2k, avg=2204.16, stdev=2596.90
    clat (usec): min=6, max=2205.8k, avg=356.42, stdev=23739.12
     lat (usec): min=25, max=2205.8k, avg=358.62, stdev=23739.12
    clat percentiles (usec):
     |  1.00th=[     84],  5.00th=[     85], 10.00th=[     86],
     | 20.00th=[     87], 30.00th=[     89], 40.00th=[     92],
     | 50.00th=[     94], 60.00th=[     95], 70.00th=[     98],
     | 80.00th=[    104], 90.00th=[    120], 95.00th=[    125],
     | 99.00th=[    182], 99.50th=[    223], 99.90th=[    322],
     | 99.95th=[    351], 99.99th=[2164261]
   bw (  KiB/s): min=856608, max=1240544, per=100.00%, avg=1048515.58, stdev=128791.36, samples=40
   iops        : min=214152, max=310136, avg=262129.02, stdev=32197.74, samples=40
  lat (usec)   : 10=0.01%, 100=74.73%, 250=24.87%, 500=0.39%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, >=2000=0.01%
  cpu          : usr=9.45%, sys=32.39%, ctx=67183, majf=0, minf=18
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,5242881,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=340MiB/s (357MB/s), 340MiB/s-340MiB/s (357MB/s-357MB/s), io=20.0GiB (21.5GB), run=60170-60170msec

Disk stats (read/write):
  sdc: ios=66/33290, sectors=2592/41943040, merge=0/5209590, ticks=5/1227916, in_queue=1227921, util=66.64%